content/config.org
#+TITLE: emacs config
#+AUTHOR: likith
#+PROPERTY: header-args:emacs-lisp :tangle ./config.el
#+DESCRIPTION: likith's personal emacs config
#+STARTUP: showeverything
#+OPTIONS: toc:2

* important programs to load first

#+begin_src emacs-lisp

  (tool-bar-mode -1)
  (defvar emacs/default-font-size 240)
  (add-to-list 'default-frame-alist '(font . "Agave Nerd Font Mono-24"))
  (menu-bar-mode -1)
  (tooltip-mode -1)
  (set-fringe-mode 10)
  (column-number-mode)
  (global-display-line-numbers-mode t)
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  eshell-mode-hook
                  treemacs-mode-hook
                  shell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))
  (require 'package)
  (package-initialize)
  (setq my-packages
        '(ivy
          counsel
          json-mode
          projectile
          cider
          clojure-mode
          expand-region
          jinja2-mode
          magit
          markdown-mode
          paredit
          wrap-region
          yaml-mode
          elpy
          json-mode
          doom-themes
          all-the-icons
          all-the-icons-dired
          which-key
          ivy-rich
          helpful
          rainbow-delimiters
          evil
          evil-collection
          forge
          evil-nerd-commenter
          projectile
          counsel-projectile
          dap-mode
          typescript-mode
          company
          company-box
          term
          eterm-256color
          vterm
          eshell-git-prompt
          eshell
          apheleia
          pet
          lsp-ui
          doom-modeline
          org
          org-bullets
          nix-mode
          olivetti
          visual-fill-column
          page-break-lines
          nerd-icons
          dashboard
          ripgrep
          consult
          orderless
          marginalia
          embark
          prettier
          prettier-js
          prettier-rc
          js2-mode
          org-edna
          treemacs
          treemacs-evil
          treemacs-icons-dired
          treemacs-magit
          treemacs-persp
          treemacs-tab-bar
          treemacs-projectile))
  (dolist (pkg my-packages)
    (unless (package-installed-p pkg)
      (package-install pkg)))
  (unless package-archive-contents
    (package-refresh-contents))
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))
  (require 'use-package)
  (setq use-package-always-ensure t)
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  (setq standard-indent 2)

  (defun lik/get-project-root ()
    (when (fboundp 'projectile-project-root)
      (projectile-project-root)))


#+end_src


* ivy
#+begin_src emacs-lisp

  (use-package ivy
    :diminish
    :bind (;("C-s" . swiper)
	   :map ivy-minibuffer-map
	   ("TAB" . ivy-alt-done)
	   ("C-l" . ivy-alt-done)
	   ("C-j" . ivy-next-line)
	   ("C-k" . ivy-previous-line)
	   :map ivy-switch-buffer-map
	   ("C-k" . ivy-previous-line)
	   ("C-l" . ivy-done)
	   ("C-d" . ivy-switch-buffer-kill)
	   :map ivy-reverse-i-search-map
	   ("C-k" . ivy-previous-line)
	   ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

#+end_src


* all the icons and all the icons dired

#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p)
    :commands all-the-icons-install-fonts
    :init
    (unless (find-font (font-spec :name "all-the-icons"))
      (all-the-icons-install-fonts t)))
  (use-package all-the-icons-dired
    :if (display-graphic-p)
    :hook (dired-mode . all-the-icons-dired-mode))
#+end_src


* doom modeline and themes

#+begin_src emacs-lisp

  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))

  (use-package doom-themes
    :init (load-theme 'doom-tomorrow-night t))

#+end_src

* which-key

#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))

#+end_src


* ivy-rich

#+begin_src emacs-lisp
  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))

#+end_src 



