public/config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs config</title>
<meta name="description" content="likith's personal emacs config" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">emacs config</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbce3f47">important programs to load first</a></li>
<li><a href="#orgb8aaa66">ivy</a></li>
<li><a href="#orgfd34164">all the icons and all the icons dired</a></li>
<li><a href="#org246e375">doom modeline and themes</a></li>
<li><a href="#orgd611b69">which-key</a></li>
<li><a href="#org63179e3">ivy-rich</a></li>
<li><a href="#orga2c7e19">counsel</a></li>
<li><a href="#org09630ff">helpful</a></li>
<li><a href="#org9abe446">rainbow-delimiters</a></li>
<li><a href="#orgc7824fe">dired and dired-single</a></li>
<li><a href="#orge2a60b4">lsp-mode</a></li>
<li><a href="#org766dbfe">evil mode</a></li>
<li><a href="#orgbf8e16d">magit</a></li>
<li><a href="#org7bde302">forge</a></li>
<li><a href="#org26fba46">evil nerd commenter</a></li>
<li><a href="#org1c4ad5a">projectile</a></li>
<li><a href="#orgc9b4f0f">dap mode</a></li>
<li><a href="#orgea6b433">apheleia</a></li>
<li><a href="#orgad924e6">eglot</a></li>
<li><a href="#orgfc9f6b7">python stuff</a></li>
<li><a href="#orgdbe44c1">typescript</a></li>
<li><a href="#org7a6cc10">company</a></li>
<li><a href="#org34bd6d0">terminal stuff</a></li>
<li><a href="#org64c290a">org mode stuff</a>
<ul>
<li><a href="#orge988eb2">org babel</a></li>
<li><a href="#org74afc79">org mode tagging stuff</a></li>
<li><a href="#orgb8264b1">org mode agenda views</a></li>
<li><a href="#org1c30619">other org mode stuff</a></li>
<li><a href="#org6adda52">org roam</a></li>
<li><a href="#orgdbdf279">org-edna</a></li>
</ul>
</li>
<li><a href="#org79978fd">vertico</a></li>
<li><a href="#org78fb26a">other function(s)</a></li>
<li><a href="#org82cb5bd">vertico</a></li>
<li><a href="#org4385ffb">consult</a></li>
<li><a href="#orgda046ac">nix mode</a></li>
<li><a href="#org0b90708">dashboard</a></li>
<li><a href="#orgcf0b251">treemacs</a></li>
<li><a href="#org501e279">javascript stuff</a></li>
<li><a href="#orgd781bba">miscellaneous settings</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbce3f47" class="outline-2">
<h2 id="orgbce3f47">important programs to load first</h2>
<div class="outline-text-2" id="text-orgbce3f47">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(tool-bar-mode -1)
(<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">emacs/default-font-size</span> 240)
(add-to-list 'default-frame-alist '(font . <span style="font-style: italic;">"Agave Nerd Font Mono-24"</span>))
(menu-bar-mode -1)
(tooltip-mode -1)
(set-fringe-mode 10)
(column-number-mode)
(global-display-line-numbers-mode t)
(<span style="font-weight: bold;">dolist</span> (mode '(org-mode-hook
                term-mode-hook
                eshell-mode-hook
                treemacs-mode-hook
                shell-mode-hook))
  (add-hook mode (<span style="font-weight: bold;">lambda</span> () (display-line-numbers-mode 0))))
(<span style="font-weight: bold;">setq</span> package-archives '((<span style="font-style: italic;">"melpa"</span> . <span style="font-style: italic;">"https://melpa.org/packages/"</span>)
                         (<span style="font-style: italic;">"org"</span> . <span style="font-style: italic;">"https://orgmode.org/elpa/"</span>)
                         (<span style="font-style: italic;">"elpa"</span> . <span style="font-style: italic;">"https://elpa.gnu.org/packages/"</span>)))
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">package</span>)
(package-initialize)
(<span style="font-weight: bold;">setq</span> my-packages
      '(ivy
        counsel
        json-mode
        projectile
        cider
        clojure-mode
        expand-region
        jinja2-mode
        magit
        markdown-mode
        paredit
        wrap-region
        yaml-mode
        elpy
        json-mode
        doom-themes
        all-the-icons
        all-the-icons-dired
        which-key
        ivy-rich
        helpful
        rainbow-delimiters
        evil
        evil-collection
        forge
        evil-nerd-commenter
        projectile
        counsel-projectile
        dap-mode
        typescript-mode
        company
        company-box
        term
        eterm-256color
        vterm
        eshell-git-prompt
        eshell
        apheleia
        pet
        lsp-ui
        doom-modeline
        org
        org-bullets
        nix-mode
        olivetti
        visual-fill-column
        page-break-lines
        nerd-icons
        dashboard
        ripgrep
        consult
        orderless
        marginalia
        embark
        prettier
        prettier-js
        prettier-rc
        js2-mode
        org-edna
        treemacs
        treemacs-evil
        treemacs-icons-dired
        treemacs-magit
        treemacs-persp
        treemacs-tab-bar
        treemacs-projectile))
(<span style="font-weight: bold;">dolist</span> (pkg my-packages)
  (<span style="font-weight: bold;">unless</span> (package-installed-p pkg)
    (package-install pkg)))
(<span style="font-weight: bold;">unless</span> package-archive-contents
  (package-refresh-contents))
(<span style="font-weight: bold;">unless</span> (package-installed-p 'use-package)
  (package-install 'use-package))
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">use-package</span>)
(<span style="font-weight: bold;">setq</span> use-package-always-ensure t)
(global-set-key (kbd <span style="font-style: italic;">"&lt;escape&gt;"</span>) 'keyboard-escape-quit)
(<span style="font-weight: bold;">setq</span> standard-indent 2)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">lik/get-project-root</span> ()
  (<span style="font-weight: bold;">when</span> (fboundp 'projectile-project-root)
    (projectile-project-root)))


</pre>
</div>
</div>
</div>


<div id="outline-container-orgb8aaa66" class="outline-2">
<h2 id="orgb8aaa66">ivy</h2>
<div class="outline-text-2" id="text-orgb8aaa66">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> ivy
  <span style="font-weight: bold;">:diminish</span>
  <span style="font-weight: bold;">:bind</span> (<span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">("C-s" . swiper)</span>
         <span style="font-weight: bold;">:map</span> ivy-minibuffer-map
         (<span style="font-style: italic;">"TAB"</span> . ivy-alt-done)
         (<span style="font-style: italic;">"C-l"</span> . ivy-alt-done)
         (<span style="font-style: italic;">"C-j"</span> . ivy-next-line)
         (<span style="font-style: italic;">"C-k"</span> . ivy-previous-line)
         <span style="font-weight: bold;">:map</span> ivy-switch-buffer-map
         (<span style="font-style: italic;">"C-k"</span> . ivy-previous-line)
         (<span style="font-style: italic;">"C-l"</span> . ivy-done)
         (<span style="font-style: italic;">"C-d"</span> . ivy-switch-buffer-kill)
         <span style="font-weight: bold;">:map</span> ivy-reverse-i-search-map
         (<span style="font-style: italic;">"C-k"</span> . ivy-previous-line)
         (<span style="font-style: italic;">"C-d"</span> . ivy-reverse-i-search-kill))
  <span style="font-weight: bold;">:config</span>
  (ivy-mode 1))

</pre>
</div>
</div>
</div>


<div id="outline-container-orgfd34164" class="outline-2">
<h2 id="orgfd34164">all the icons and all the icons dired</h2>
<div class="outline-text-2" id="text-orgfd34164">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> all-the-icons
  <span style="font-weight: bold;">:if</span> (display-graphic-p)
  <span style="font-weight: bold;">:commands</span> all-the-icons-install-fonts
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">unless</span> (find-font (font-spec <span style="font-weight: bold;">:name</span> <span style="font-style: italic;">"all-the-icons"</span>))
    (all-the-icons-install-fonts t)))
(<span style="font-weight: bold;">use-package</span> all-the-icons-dired
  <span style="font-weight: bold;">:if</span> (display-graphic-p)
  <span style="font-weight: bold;">:hook</span> (dired-mode . all-the-icons-dired-mode))
</pre>
</div>
</div>
</div>


<div id="outline-container-org246e375" class="outline-2">
<h2 id="org246e375">doom modeline and themes</h2>
<div class="outline-text-2" id="text-org246e375">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> doom-modeline
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span> (doom-modeline-mode 1)
  <span style="font-weight: bold;">:custom</span> ((doom-modeline-height 15)))

(<span style="font-weight: bold;">use-package</span> doom-themes
  <span style="font-weight: bold;">:init</span> (load-theme 'doom-tomorrow-night t))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgd611b69" class="outline-2">
<h2 id="orgd611b69">which-key</h2>
<div class="outline-text-2" id="text-orgd611b69">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> which-key
  <span style="font-weight: bold;">:init</span> (which-key-mode)
  <span style="font-weight: bold;">:diminish</span> which-key-mode
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> which-key-idle-delay 1))

</pre>
</div>
</div>
</div>


<div id="outline-container-org63179e3" class="outline-2">
<h2 id="org63179e3">ivy-rich</h2>
<div class="outline-text-2" id="text-org63179e3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> ivy-rich
  <span style="font-weight: bold;">:init</span>
  (ivy-rich-mode 1))

</pre>
</div>
</div>
</div>
