public/config.html



<div id="outline-container-orga2c7e19" class="outline-2">
<h2 id="orga2c7e19">counsel</h2>
<div class="outline-text-2" id="text-orga2c7e19">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> counsel
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-M-j"</span> . 'counssel-switch-buffer)
         <span style="font-weight: bold;">:map</span> minibuffer-local-map
         (<span style="font-style: italic;">"C-r"</span> . 'counsel-minibuffer-history))
  <span style="font-weight: bold;">:custom</span>
  (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
  <span style="font-weight: bold;">:config</span>
  (counsel-mode 1))
</pre>
</div>
</div>
</div>

<div id="outline-container-org09630ff" class="outline-2">
<h2 id="org09630ff">helpful</h2>
<div class="outline-text-2" id="text-org09630ff">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> helpful
  <span style="font-weight: bold;">:custom</span>
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  <span style="font-weight: bold;">:bind</span>
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9abe446" class="outline-2">
<h2 id="org9abe446">rainbow-delimiters</h2>
<div class="outline-text-2" id="text-org9abe446">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> rainbow-delimiters
  <span style="font-weight: bold;">:hook</span> (prog-mode . rainbow-delimiters-mode))
(global-set-key (kbd <span style="font-style: italic;">"C-M-j"</span>) 'counsel-switch-buffer)
(global-set-key (kbd <span style="font-style: italic;">"C-M-k"</span>) 'dw/switch-to-browser-buffer)

</pre>
</div>
</div>
</div>


<div id="outline-container-orgc7824fe" class="outline-2">
<h2 id="orgc7824fe">dired and dired-single</h2>
<div class="outline-text-2" id="text-orgc7824fe">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> dired
  <span style="font-weight: bold;">:ensure</span> nil
  <span style="font-weight: bold;">:commands</span> (dired dired-find-file)
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-x C-j"</span> . dired-find-file))
  <span style="font-weight: bold;">:custom</span> ((dired-listing-switches <span style="font-style: italic;">"-agho --group-directories-first"</span>)))

(<span style="font-weight: bold;">use-package</span> dired-single
  <span style="font-weight: bold;">:commands</span> (dired dired-jump))

(<span style="font-weight: bold;">use-package</span> dired-open
  <span style="font-weight: bold;">:commands</span> (dired dired-jump)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> dired-open-extensions '((<span style="font-style: italic;">"png"</span> . <span style="font-style: italic;">"feh"</span>)
                                (<span style="font-style: italic;">"mkv"</span> . <span style="font-style: italic;">"mpv"</span>))))
(<span style="font-weight: bold;">use-package</span> dired-hide-dotfiles
  <span style="font-weight: bold;">:hook</span> (dired-mode . dired-hide-dotfiles-mode)
  <span style="font-weight: bold;">:config</span>
  (evil-collection-define-key 'normal 'dired-mode-map
                              <span style="font-style: italic;">"H"</span> 'dired-hide-dotfiles-mode))
(<span style="font-weight: bold;">setq</span> gc-cons-threshold (* 2 1000 1000))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2a60b4" class="outline-2">
<h2 id="orge2a60b4">lsp-mode</h2>
<div class="outline-text-2" id="text-orge2a60b4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/lsp-mode-setup</span> ()
  (<span style="font-weight: bold;">setq</span> lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(<span style="font-weight: bold;">use-package</span> lsp-mode
  <span style="font-weight: bold;">:commands</span> (lsp lsp-deferred)
  <span style="font-weight: bold;">:hook</span> (lsp-mode . efs/lsp-mode-setup)
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">setq</span> lsp-keymap-prefix <span style="font-style: italic;">"C-c l"</span>)

  <span style="font-weight: bold;">:config</span>
  (lsp-enable-which-key-integration t))

(<span style="font-weight: bold;">use-package</span> lsp-ui
  <span style="font-weight: bold;">:hook</span> (lsp-mode . lsp-ui-mode)
  <span style="font-weight: bold;">:custom</span>
  (lsp-ui-doc-position 'bottom))

(<span style="font-weight: bold;">use-package</span> lsp-treemacs
  <span style="font-weight: bold;">:after</span> lsp)

(<span style="font-weight: bold;">use-package</span> lsp-ivy
  <span style="font-weight: bold;">:after</span> lsp)


</pre>
</div>
</div>
</div>


<div id="outline-container-org766dbfe" class="outline-2">
<h2 id="org766dbfe">evil mode</h2>
<div class="outline-text-2" id="text-org766dbfe">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> evil
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">setq</span> evil-want-integration t)
  (<span style="font-weight: bold;">setq</span> evil-want-keybinding nil)
  (<span style="font-weight: bold;">setq</span> evil-want-C-u-scroll t)
  (<span style="font-weight: bold;">setq</span> evil-want-C-i-jump nil)
  <span style="font-weight: bold;">:config</span>
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd <span style="font-style: italic;">"C-g"</span>)  'evil-normal-state)
  (define-key evil-insert-state-map (kbd <span style="font-style: italic;">"C-h"</span>) 'evil-delete-backward-char-and-join)
  (evil-global-set-key 'motion <span style="font-style: italic;">"j"</span> 'evil-next-visual-line)
  (evil-global-set-key 'motion <span style="font-style: italic;">"k"</span> 'evil-previous-visual-line)
  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(<span style="font-weight: bold;">use-package</span> evil-collection
  <span style="font-weight: bold;">:after</span> evil
  <span style="font-weight: bold;">:config</span>
  (evil-collection-init))

</pre>
</div>
</div>
</div>


<div id="outline-container-orgbf8e16d" class="outline-2">
<h2 id="orgbf8e16d">magit</h2>
<div class="outline-text-2" id="text-orgbf8e16d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> magit
  <span style="font-weight: bold;">:commands</span> (magit-status magit-get-current-branch)
  <span style="font-weight: bold;">:custom</span>
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
(global-set-key (kbd <span style="font-style: italic;">"C-M-;"</span>) 'magit-status)

</pre>
</div>
</div>
</div>

<div id="outline-container-org7bde302" class="outline-2">
<h2 id="org7bde302">forge</h2>
<div class="outline-text-2" id="text-org7bde302">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> forge
  <span style="font-weight: bold;">:after</span> magit)
</pre>
</div>
</div>
</div>


<div id="outline-container-org26fba46" class="outline-2">
<h2 id="org26fba46">evil nerd commenter</h2>
<div class="outline-text-2" id="text-org26fba46">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> evil-nerd-commenter
  <span style="font-weight: bold;">:bind</span> (<span style="font-style: italic;">"M-/"</span> . evilnc-comment-or-uncomment-lines))
</pre>
</div>
</div>
</div>


<div id="outline-container-org1c4ad5a" class="outline-2">
<h2 id="org1c4ad5a">projectile</h2>
<div class="outline-text-2" id="text-org1c4ad5a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> projectile
  <span style="font-weight: bold;">:diminish</span> projectile-mode
  <span style="font-weight: bold;">:config</span> (projectile-mode)
  <span style="font-weight: bold;">:custom</span> ((projectile-completion-system 'ivy))
  <span style="font-weight: bold;">:bind</span> (<span style="font-style: italic;">"C-M-p"</span> . projectile-find-file)
  <span style="font-weight: bold;">:bind-keymap</span>
  (<span style="font-style: italic;">"C-c p"</span> . projectile-command-map)
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">when</span> (file-directory-p <span style="font-style: italic;">"~/Documents"</span>)
    (<span style="font-weight: bold;">setq</span> projectile-project-search-path '(<span style="font-style: italic;">"~/Documents"</span>)))
  (<span style="font-weight: bold;">setq</span> projectile-switch-project-action #'projectile-dired))

(<span style="font-weight: bold;">use-package</span> counsel-projectile
  <span style="font-weight: bold;">:disabled</span>
  <span style="font-weight: bold;">:after</span> projectile
  <span style="font-weight: bold;">:config</span> (counsel-projectile-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc9b4f0f" class="outline-2">
<h2 id="orgc9b4f0f">dap mode</h2>
<div class="outline-text-2" id="text-orgc9b4f0f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> dap-mode
  <span style="font-weight: bold;">:commands</span> dab-debug
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">dap-node</span>)
  (dap-node-setup)

  (general-define-key
   <span style="font-weight: bold;">:keymaps</span> 'lsp-mode-map
   <span style="font-weight: bold;">:prefix</span> lsp-keymap-prefix
   <span style="font-style: italic;">"d"</span> '(dap-hydra t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"debugger"</span>)))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgea6b433" class="outline-2">
<h2 id="orgea6b433">apheleia</h2>
<div class="outline-text-2" id="text-orgea6b433">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> apheleia
  <span style="font-weight: bold;">:defines</span> (apheleia-formatters apheleia-mode-alist)
  <span style="font-weight: bold;">:hook</span> (after-init . apheleia-global-mode)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setf</span> (alist-get 'python-mode apheleia-mode-alist) '(ruff-isort ruff))
  (<span style="font-weight: bold;">setf</span> (alist-get 'python-ts-mode apheleia-mode-alist) '(ruff-isort ruff)))
</pre>
</div>
</div>
</div>
