public/config.html


<div id="outline-container-orgad924e6" class="outline-2">
<h2 id="orgad924e6">eglot</h2>
<div class="outline-text-2" id="text-orgad924e6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> eglot
  <span style="font-weight: bold;">:hook</span> (python-base-mode . eglot-ensure)
  <span style="font-weight: bold;">:custom</span> (eglot-autopshutdown t))
</pre>
</div>
</div>
</div>


<div id="outline-container-orgfc9f6b7" class="outline-2">
<h2 id="orgfc9f6b7">python stuff</h2>
<div class="outline-text-2" id="text-orgfc9f6b7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> python-mode
  <span style="font-weight: bold;">:hook</span> (python-mode . lsp-deferred)
  <span style="font-weight: bold;">:custom</span>
  (dap-python-debugger 'debugpy)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">dap-python</span>))

(<span style="font-weight: bold;">use-package</span> pyvenv
  <span style="font-weight: bold;">:after</span> python-mode
  <span style="font-weight: bold;">:config</span>
  (pyvenv-mode 1))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdbe44c1" class="outline-2">
<h2 id="orgdbe44c1">typescript</h2>
<div class="outline-text-2" id="text-orgdbe44c1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> typescript-mode
  <span style="font-weight: bold;">:mode</span> <span style="font-style: italic;">"\\.ts\\'"</span>
  <span style="font-weight: bold;">:hook</span> (typescript-mode .lsp-deferred)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> typescript-indent-level 2))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a6cc10" class="outline-2">
<h2 id="org7a6cc10">company</h2>
<div class="outline-text-2" id="text-org7a6cc10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> company
  <span style="font-weight: bold;">:after</span> lsp-mode
  <span style="font-weight: bold;">:hook</span> (lsp-mode . company-mode)
  <span style="font-weight: bold;">:bind</span> (<span style="font-weight: bold;">:map</span> company-active-map
              (<span style="font-style: italic;">"&lt;tab&gt;"</span> . company-complete-selection))
  (<span style="font-weight: bold;">:map</span> lsp-mode-map
        (<span style="font-style: italic;">"&lt;tab&gt;"</span> . company-indent-or-complete-common))
  <span style="font-weight: bold;">:custom</span>
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(<span style="font-weight: bold;">use-package</span> company-box
  <span style="font-weight: bold;">:hook</span> (company-mode . company-box-mode))

</pre>
</div>
</div>
</div>


<div id="outline-container-org34bd6d0" class="outline-2">
<h2 id="org34bd6d0">terminal stuff</h2>
<div class="outline-text-2" id="text-org34bd6d0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> term
  <span style="font-weight: bold;">:commands</span> term
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> explicit-shell-file-name <span style="font-style: italic;">"fish"</span>))

(<span style="font-weight: bold;">use-package</span> eterm-256color
  <span style="font-weight: bold;">:hook</span> (term-mode . eterm-256color-mode))

(<span style="font-weight: bold;">use-package</span> vterm
  <span style="font-weight: bold;">:commands</span> vterm
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> vterm-shell <span style="font-style: italic;">"fish"</span>)
  (<span style="font-weight: bold;">setq</span> vterm-max-scrollback 10000))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/configure-eshell</span> ()
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd <span style="font-style: italic;">"C-r"</span>) 'counsel-esh-history)
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd <span style="font-style: italic;">"&lt;home&gt;"</span>) 'eshell-bol)
  (evil-normalize-keymaps)
  (<span style="font-weight: bold;">setq</span> eshell-history-size 10000
        eshell-buffer-maximum-lines 10000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t))

(<span style="font-weight: bold;">use-package</span> eshell-git-prompt
  <span style="font-weight: bold;">:after</span> eshell)

(<span style="font-weight: bold;">use-package</span> eshell
  <span style="font-weight: bold;">:hook</span> (eshell-first-time-mode . efs/configure-eshell)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">with-eval-after-load</span> 'esh-opt
    (<span style="font-weight: bold;">setq</span> eshell-destroy-buffer-when-process-dies t)
    (<span style="font-weight: bold;">setq</span> eshell-visual-commands '(<span style="font-style: italic;">"htop"</span> <span style="font-style: italic;">"zsh"</span> <span style="font-style: italic;">"vim"</span>)))
(eshell-git-prompt-use-theme 'powerline))

</pre>
</div>
</div>
</div>
