public/config.html

<div id="outline-container-org64c290a" class="outline-2">
<h2 id="org64c290a">org mode stuff</h2>
<div class="outline-text-2" id="text-org64c290a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/org-mode-setup</span> ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (auto-fill-mode 0)
  (visual-line-mode 1)
  (<span style="font-weight: bold;">setq</span> evil-auto-indent nil))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/org-font-setup</span> ()
  (font-lock-add-keywords 'org-mode
                          '((<span style="font-style: italic;">"^ *</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">[-]</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;"> "</span>
                             (0 (<span style="font-weight: bold;">prog1</span> () (compose-region (match-beginning 1) (match-end 1) <span style="font-style: italic;">"&#8226;"</span>))))))
  (<span style="font-weight: bold;">dolist</span> (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil <span style="font-weight: bold;">:font</span> <span style="font-style: italic;">"Cantarell"</span> <span style="font-weight: bold;">:weight</span> 'regular <span style="font-weight: bold;">:height</span> (cdr face)))
  (set-face-attribute 'org-block nil <span style="font-weight: bold;">:foreground</span> nil <span style="font-weight: bold;">:inherit</span> 'fixed-pitch)
  (set-face-attribute 'org-code nil <span style="font-weight: bold;">:inherit</span> '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil <span style="font-weight: bold;">:inherit</span> '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil <span style="font-weight: bold;">:inherit</span> '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil <span style="font-weight: bold;">:inherit</span> '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil <span style="font-weight: bold;">:inherit</span> 'fixed-pitch))

(<span style="font-weight: bold;">use-package</span> org
  <span style="font-weight: bold;">:hook</span> (org-mode . efs/org-mode-setup)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> org-ellipsis <span style="font-style: italic;">"&#9660;"</span>)
  (<span style="font-weight: bold;">setq</span> org-directory <span style="font-style: italic;">"~/Documents/orgfiles"</span>)
  (<span style="font-weight: bold;">setq</span> org-agenda-files
        '(<span style="font-style: italic;">"tasks.org"</span>
          <span style="font-style: italic;">"birthdays.org"</span>
          <span style="font-style: italic;">"~/org_mode_exp/example-file.org"</span>
          <span style="font-style: italic;">"~/Documents/wizr/gmail_data/readme.org"</span>
          <span style="font-style: italic;">"~/Documents/wizr/work_master.org"</span>))
  (<span style="font-weight: bold;">setq</span> org-agenda-start-with-log-mode t)
  (<span style="font-weight: bold;">setq</span> org-log-done 'time)
  (<span style="font-weight: bold;">setq</span> org-log-into-drawer t)
  (efs/org-font-setup))

(<span style="font-weight: bold;">use-package</span> org-bullets
  <span style="font-weight: bold;">:after</span> org
  <span style="font-weight: bold;">:hook</span> (org-mode . org-bullets-mode)
  <span style="font-weight: bold;">:custom</span>
  (org-bullets-bullet-list '(<span style="font-style: italic;">"&#9673;"</span> <span style="font-style: italic;">"&#9675;"</span> <span style="font-style: italic;">"&#9679;"</span> <span style="font-style: italic;">"&#9675;"</span> <span style="font-style: italic;">"&#9679;"</span> <span style="font-style: italic;">"&#9675;"</span> <span style="font-style: italic;">"&#9679;"</span>)))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/org-mode-visual-fill</span> ()
  (<span style="font-weight: bold;">setq</span> visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(<span style="font-weight: bold;">use-package</span> visual-fill-column
  <span style="font-weight: bold;">:hook</span> (org-mode . efs/org-mode-visual-fill))
(<span style="font-weight: bold;">setq-default</span> org-pretty-entities t)
(<span style="font-weight: bold;">setq-default</span> org-use-sub-superscripts <span style="font-style: italic;">"{}"</span>)
(<span style="font-weight: bold;">setq-default</span> org-startup-with-inline-images t)
(<span style="font-weight: bold;">setq-default</span> org-image-actual-width '(300))
(<span style="font-weight: bold;">setq-default</span> org-hide-emphasis-markers t)
(global-set-key (kbd <span style="font-style: italic;">"C-c l"</span>) #'org-store-link)
(global-set-key (kbd <span style="font-style: italic;">"C-c a"</span>) #'org-agenda)
(global-set-key (kbd <span style="font-style: italic;">"C-c c"</span>) #'org-capture)
(font-lock-add-keywords 'org-mode
                        '((<span style="font-style: italic;">"^ *</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">[-]</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;"> "</span>
                           (0 (<span style="font-weight: bold;">prog1</span> () (compose-region (match-beginning 1) (match-end 1) <span style="font-style: italic;">"&#9679;"</span>))))))
</pre>
</div>
</div>


<div id="outline-container-orge988eb2" class="outline-3">
<h3 id="orge988eb2">org babel</h3>
<div class="outline-text-3" id="text-orge988eb2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (eshell . t)
   (gnuplot . t)
   (sed . t)
   (awk . t)
   (clojure . t)
   (css . t)
   (java . t)
   (latex . t)
   (lua . t)
   (lisp . t)
   (makefile . t)
   (js . t)
   (org . t)
   (perl . t)
   (sql . t)))

(<span style="font-weight: bold;">setq</span> org-confirm-babel-evaluate nil)

</pre>
</div>
</div>
</div>

<div id="outline-container-org74afc79" class="outline-3">
<h3 id="org74afc79">org mode tagging stuff</h3>
<div class="outline-text-3" id="text-org74afc79">
</div>
<div id="outline-container-org8d09566" class="outline-4">
<h4 id="org8d09566">workflow states</h4>
<div class="outline-text-4" id="text-org8d09566">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">setq</span> org-todo-keywords
    '((sequence <span style="font-style: italic;">"TODO(t)"</span> <span style="font-style: italic;">"IN PROGRESS(p)"</span> <span style="font-style: italic;">"WAITING(w)"</span> <span style="font-style: italic;">"|"</span> <span style="font-style: italic;">"DONE(d!)"</span>)
      (sequence <span style="font-style: italic;">"BACKLOG(b)"</span> <span style="font-style: italic;">"PLAN(p)"</span> <span style="font-style: italic;">"READY(r)"</span> <span style="font-style: italic;">"ACTIVE(a)"</span> <span style="font-style: italic;">"REVIEW(v)"</span> <span style="font-style: italic;">"WAIT(w@/!)"</span> <span style="font-style: italic;">"HOLD(h)"</span> <span style="font-style: italic;">"|"</span> <span style="font-style: italic;">"COMPLETED(c)"</span> <span style="font-style: italic;">"CANC(k@)"</span>)))
(<span style="font-weight: bold;">setq</span> org-refile-targets
      '((<span style="font-style: italic;">"archive.org"</span> <span style="font-weight: bold;">:maxlevel</span> . 1)
        (<span style="font-style: italic;">"tasks.org"</span> <span style="font-weight: bold;">:maxlevel</span> . 1)))
(advice-add 'org-refile <span style="font-weight: bold;">:after</span> 'org-save-all-org-buffers)
</pre>
</div>
</div>
</div>


<div id="outline-container-org768a0b7" class="outline-4">
<h4 id="org768a0b7">tags</h4>
<div class="outline-text-4" id="text-org768a0b7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">setq</span> org-tag-alist
      '((<span style="font-weight: bold;">:startgroup</span>)
        <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">put mutually exclusive tags here</span>
        (<span style="font-weight: bold;">:endgroup</span>)
        (<span style="font-style: italic;">"errand"</span> . ?E)
        (<span style="font-style: italic;">"home"</span> . ?H)
        (<span style="font-style: italic;">"work"</span> . ?W)
        (<span style="font-style: italic;">"agenda"</span> . ?a)
        (<span style="font-style: italic;">"planning"</span> . ?p)
        (<span style="font-style: italic;">"publish"</span> . ?P)
        (<span style="font-style: italic;">"batch"</span> . ?b)
        (<span style="font-style: italic;">"note"</span> . ?n)
        (<span style="font-style: italic;">"idea"</span> . ?i)
        (<span style="font-style: italic;">"thinking"</span> . ?t)
        (<span style="font-style: italic;">"recurring"</span> . ?r)))

</pre>
</div>
</div>
</div>
</div>
