content/config.org
** org mode agenda views


#+begin_src emacs-lisp

  (setq org-agenda-custom-commands
        '(("d" "dashboard"
           ((agenda "" ((org-deadline-warning-days 7)))
            (todo "NEXT"
                  ((org-agenda-overriding-header "next tasks")))
            (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "active projects")))))
          ("n" "next tasks"
           ((todo "NEXT"
                  ((org-agenda-overriding-header "next tasks")))))
          ("W" "work tasks" tags-todo "+work")
          ("e" tags-todo "+TODO=\"NEXT\"+effort<15&+effort>0"
           ((org-agenda-overriding-header "low effort tasks")
            (org-agenda-max-todos 20)
            (org-agenda-files org-agenda-files)))
          ("w" "workflow status"
           ((todo "WAIT"
                  ((org-agenda-files org-agenda-files)))
            (todo "REVIEW"
                  ((org-agenda-overriding-header "in review")
                   (org-agenda-files org-agenda-files)))
            (todo "PLAN"
                  ((org-agenda-overriding-header "in planning")
                   (org-agenda-todo-list-sublevels nil)
                   (org-agenda-files org-agenda-files)))
            (todo "BACKLOG"
                  ((org-agenda-overriding-header "project backlog")
                   (org-agenda-todo-list-sublevels nil)
                   (org-agenda-files org-agenda-files)))
            (todo "READY"
                  ((org-agenda-overriding-header "ready for work")
                   (org-agenda-files org-agenda-files)))
            (todo "ACTIVE"
                  ((org-agenda-overriding-header "active projects")
                   (org-agenda-files org-agenda-files)))
            (todo "COMPLETED"
                  ((org-agenda-overriding-header "completed projects")
                   (org-agenda-files org-agenda-files)))
            (todo "CANC"
                  ((org-agenda-overriding-header "cancelled projects")
                   (org-agenda-files org-agenda-files)))))))
   #+end_src



** other org mode stuff

#+begin_src emacs-lisp
  (use-package org-appear
    :hook
    (org-mode . org-appear-mode))

  (use-package org-modern
    :hook
    (org-mode . global-org-modern-mode)
    :custom
    (org-modern-keyword nil)
    (org-modern-checkbox nil)
    (org-modern-table nil))

  (use-package olivetti
    :demand t
    :bind
    (("<f9>" . ews-distraction-free)))

  (defun ews-distraction-free ()
    (interactive)
    (if (equal olivetti-mode nil)
        (progn
          (window-configuration-to-register 1)
          (delete-other-windows)
          (text-scale-set 2)
          (olivetti-mode t))
      (progn
        (if (eq (length (window-list)) 1)
            (jump-to-register 1))
        (olivetti-mode 0)
        (text-scale-set 0))))

  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))

#+end_src

** org roam

#+begin_src emacs-lisp

          (use-package emacsql)
          (use-package org-roam
            :ensure t
            :init
            (setq org-roam-v2-ack t)
            :custom
            (org-roam-directory "~/Documents/roamnotes")
            (org-roam-completion-everywhere t)
            (org-roam-capture-templates
             '(("d" "default" plain
                "%?"
                :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
                :unnarrowed t)
               ("m" "Team Meeting" plain
                "\n* Minutes\n\n%?"
                :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n#+filetags:work")
                :unnarrowed t)))
            (org-roam-dailies-capture-templates
            '(("d" "default" entry "* %<%I:%M %p>: %?"
               :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))
              ("j" "journal" entry "* %<%I:%M %p>: %?"
               :if-new (file+head "journal/%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d> journal \n"))
              ("m" "meeting" entry "* %<%I:%M %p>: %?"
               :if-new (file+head "meetings/%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d> meeting \n"))))
            :bind (("C-c n l" . org-roam-buffer-toggle)
                   ("C-c n f" . org-roam-node-find)
                   ("C-c n i" . org-roam-node-insert)
                   :map org-mode-map
                   ("C-M-i" . completion-at-point)
                   :map org-roam-dailies-map
                   ("Y" . org-roam-dailies-capture-yesterday)
                   ("T" . org-roam-dailies-capture-tomorrow))
            :bind-keymap
            ("C-c n d" . org-roam-dailies-map)
            :config
            (require 'org-roam-dailies)
            (org-roam-setup)
            (setq org-roam-dailies-directory "daily/")
            (org-roam-db-autosync-mode))
#+end_src

[[https://github.com/Alexander-Miller/treemacs][treemacs]]
[[https://github.com/thisirs/openwith][emacs openwith]]
[[https://youtube.com/watch?v=rwKTc4MNmt8][modern emacs UI]]

vertico
selectrum
marginalia

** org-edna
for task dependencies
#+begin_src emacs-lisp

  (org-edna-mode)
#+end_src


