public/config.html


<div id="outline-container-orgb8264b1" class="outline-3">
<h3 id="orgb8264b1">org mode agenda views</h3>
<div class="outline-text-3" id="text-orgb8264b1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">setq</span> org-agenda-custom-commands
      '((<span style="font-style: italic;">"d"</span> <span style="font-style: italic;">"dashboard"</span>
         ((agenda <span style="font-style: italic;">""</span> ((org-deadline-warning-days 7)))
          (todo <span style="font-style: italic;">"NEXT"</span>
                ((org-agenda-overriding-header <span style="font-style: italic;">"next tasks"</span>)))
          (tags-todo <span style="font-style: italic;">"agenda/ACTIVE"</span> ((org-agenda-overriding-header <span style="font-style: italic;">"active projects"</span>)))))
        (<span style="font-style: italic;">"n"</span> <span style="font-style: italic;">"next tasks"</span>
         ((todo <span style="font-style: italic;">"NEXT"</span>
                ((org-agenda-overriding-header <span style="font-style: italic;">"next tasks"</span>)))))
        (<span style="font-style: italic;">"W"</span> <span style="font-style: italic;">"work tasks"</span> tags-todo <span style="font-style: italic;">"+work"</span>)
        (<span style="font-style: italic;">"e"</span> tags-todo <span style="font-style: italic;">"+TODO=\"NEXT\"+effort&lt;15&amp;+effort&gt;0"</span>
         ((org-agenda-overriding-header <span style="font-style: italic;">"low effort tasks"</span>)
          (org-agenda-max-todos 20)
          (org-agenda-files org-agenda-files)))
        (<span style="font-style: italic;">"w"</span> <span style="font-style: italic;">"workflow status"</span>
         ((todo <span style="font-style: italic;">"WAIT"</span>
                ((org-agenda-files org-agenda-files)))
          (todo <span style="font-style: italic;">"REVIEW"</span>
                ((org-agenda-overriding-header <span style="font-style: italic;">"in review"</span>)
                 (org-agenda-files org-agenda-files)))
          (todo <span style="font-style: italic;">"PLAN"</span>
                ((org-agenda-overriding-header <span style="font-style: italic;">"in planning"</span>)
                 (org-agenda-todo-list-sublevels nil)
                 (org-agenda-files org-agenda-files)))
          (todo <span style="font-style: italic;">"BACKLOG"</span>
                ((org-agenda-overriding-header <span style="font-style: italic;">"project backlog"</span>)
                 (org-agenda-todo-list-sublevels nil)
                 (org-agenda-files org-agenda-files)))
          (todo <span style="font-style: italic;">"READY"</span>
                ((org-agenda-overriding-header <span style="font-style: italic;">"ready for work"</span>)
                 (org-agenda-files org-agenda-files)))
          (todo <span style="font-style: italic;">"ACTIVE"</span>
                ((org-agenda-overriding-header <span style="font-style: italic;">"active projects"</span>)
                 (org-agenda-files org-agenda-files)))
          (todo <span style="font-style: italic;">"COMPLETED"</span>
                ((org-agenda-overriding-header <span style="font-style: italic;">"completed projects"</span>)
                 (org-agenda-files org-agenda-files)))
          (todo <span style="font-style: italic;">"CANC"</span>
                ((org-agenda-overriding-header <span style="font-style: italic;">"cancelled projects"</span>)
                 (org-agenda-files org-agenda-files)))))))
</pre>
</div>
</div>
</div>



<div id="outline-container-org1c30619" class="outline-3">
<h3 id="org1c30619">other org mode stuff</h3>
<div class="outline-text-3" id="text-org1c30619">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> org-appear
  <span style="font-weight: bold;">:hook</span>
  (org-mode . org-appear-mode))

(<span style="font-weight: bold;">use-package</span> org-modern
  <span style="font-weight: bold;">:hook</span>
  (org-mode . global-org-modern-mode)
  <span style="font-weight: bold;">:custom</span>
  (org-modern-keyword nil)
  (org-modern-checkbox nil)
  (org-modern-table nil))

(<span style="font-weight: bold;">use-package</span> olivetti
  <span style="font-weight: bold;">:demand</span> t
  <span style="font-weight: bold;">:bind</span>
  ((<span style="font-style: italic;">"&lt;f9&gt;"</span> . ews-distraction-free)))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">ews-distraction-free</span> ()
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">if</span> (equal olivetti-mode nil)
      (<span style="font-weight: bold;">progn</span>
        (window-configuration-to-register 1)
        (delete-other-windows)
        (text-scale-set 2)
        (olivetti-mode t))
    (<span style="font-weight: bold;">progn</span>
      (<span style="font-weight: bold;">if</span> (eq (length (window-list)) 1)
          (jump-to-register 1))
      (olivetti-mode 0)
      (text-scale-set 0))))

(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">org-tempo</span>)
(add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"sh"</span> . <span style="font-style: italic;">"src shell"</span>))
(add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"el"</span> . <span style="font-style: italic;">"src emacs-lisp"</span>))
(add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"py"</span> . <span style="font-style: italic;">"src python"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-org6adda52" class="outline-3">
<h3 id="org6adda52">org roam</h3>
<div class="outline-text-3" id="text-org6adda52">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> emacsql)
(<span style="font-weight: bold;">use-package</span> org-roam
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">setq</span> org-roam-v2-ack t)
  <span style="font-weight: bold;">:custom</span>
  (org-roam-directory <span style="font-style: italic;">"~/Documents/roamnotes"</span>)
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
   '((<span style="font-style: italic;">"d"</span> <span style="font-style: italic;">"default"</span> plain
      <span style="font-style: italic;">"%?"</span>
      <span style="font-weight: bold;">:if-new</span> (file+head <span style="font-style: italic;">"%&lt;%Y%m%d%H%M%S&gt;-${slug}.org"</span> <span style="font-style: italic;">"#+title: ${title}\n#+date: %U\n"</span>)
      <span style="font-weight: bold;">:unnarrowed</span> t)
     (<span style="font-style: italic;">"m"</span> <span style="font-style: italic;">"Team Meeting"</span> plain
      <span style="font-style: italic;">"\n* Minutes\n\n%?"</span>
      <span style="font-weight: bold;">:if-new</span> (file+head <span style="font-style: italic;">"%&lt;%Y%m%d%H%M%S&gt;-${slug}.org"</span> <span style="font-style: italic;">"#+title: ${title}\n#+date: %U\n#+filetags:work"</span>)
      <span style="font-weight: bold;">:unnarrowed</span> t)))
  (org-roam-dailies-capture-templates
  '((<span style="font-style: italic;">"d"</span> <span style="font-style: italic;">"default"</span> entry <span style="font-style: italic;">"* %&lt;%I:%M %p&gt;: %?"</span>
     <span style="font-weight: bold;">:if-new</span> (file+head <span style="font-style: italic;">"%&lt;%Y-%m-%d&gt;.org"</span> <span style="font-style: italic;">"#+title: %&lt;%Y-%m-%d&gt;\n"</span>))
    (<span style="font-style: italic;">"j"</span> <span style="font-style: italic;">"journal"</span> entry <span style="font-style: italic;">"* %&lt;%I:%M %p&gt;: %?"</span>
     <span style="font-weight: bold;">:if-new</span> (file+head <span style="font-style: italic;">"journal/%&lt;%Y-%m-%d&gt;.org"</span> <span style="font-style: italic;">"#+title: %&lt;%Y-%m-%d&gt; journal \n"</span>))
    (<span style="font-style: italic;">"m"</span> <span style="font-style: italic;">"meeting"</span> entry <span style="font-style: italic;">"* %&lt;%I:%M %p&gt;: %?"</span>
     <span style="font-weight: bold;">:if-new</span> (file+head <span style="font-style: italic;">"meetings/%&lt;%Y-%m-%d&gt;.org"</span> <span style="font-style: italic;">"#+title: %&lt;%Y-%m-%d&gt; meeting \n"</span>))))
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-c n l"</span> . org-roam-buffer-toggle)
         (<span style="font-style: italic;">"C-c n f"</span> . org-roam-node-find)
         (<span style="font-style: italic;">"C-c n i"</span> . org-roam-node-insert)
         <span style="font-weight: bold;">:map</span> org-mode-map
         (<span style="font-style: italic;">"C-M-i"</span> . completion-at-point)
         <span style="font-weight: bold;">:map</span> org-roam-dailies-map
         (<span style="font-style: italic;">"Y"</span> . org-roam-dailies-capture-yesterday)
         (<span style="font-style: italic;">"T"</span> . org-roam-dailies-capture-tomorrow))
  <span style="font-weight: bold;">:bind-keymap</span>
  (<span style="font-style: italic;">"C-c n d"</span> . org-roam-dailies-map)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">org-roam-dailies</span>)
  (org-roam-setup)
  (<span style="font-weight: bold;">setq</span> org-roam-dailies-directory <span style="font-style: italic;">"daily/"</span>)
  (org-roam-db-autosync-mode))
</pre>
</div>

<p>
<a href="https://github.com/Alexander-Miller/treemacs">treemacs</a>
<a href="https://github.com/thisirs/openwith">emacs openwith</a>
<a href="https://youtube.com/watch?v=rwKTc4MNmt8">modern emacs UI</a>
</p>

<p>
vertico
selectrum
marginalia
</p>
</div>
</div>

<div id="outline-container-orgdbdf279" class="outline-3">
<h3 id="orgdbdf279">org-edna</h3>
<div class="outline-text-3" id="text-orgdbdf279">
<p>
for task dependencies
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(org-edna-mode)
</pre>
</div>
</div>
</div>
</div>
