content/config.org
* other function(s)


#+begin_src emacs-lisp
  (defun efs/read-file-as-string (path)
    (with-temp-buffer
      (insert-file-contents path)
      (buffer-string)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes)


#+end_src


