public/config.html

<div id="outline-container-org79978fd" class="outline-2">
<h2 id="org79978fd">vertico</h2>
<div class="outline-text-2" id="text-org79978fd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

</pre>
</div>
</div>
</div>

<div id="outline-container-org78fb26a" class="outline-2">
<h2 id="org78fb26a">other function(s)</h2>
<div class="outline-text-2" id="text-org78fb26a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/read-file-as-string</span> (path)
  (<span style="font-weight: bold;">with-temp-buffer</span>
    (insert-file-contents path)
    (buffer-string)))

(<span style="font-weight: bold;">push</span> '(<span style="font-style: italic;">"conf-unix"</span> . conf-unix) org-src-lang-modes)


</pre>
</div>
</div>
</div>
