content/config.org
* vertico

#+begin_src emacs-lisp


    (defun dw/minibuffer-backward-kill (arg)
    "When minibuffer is completing a file name delete up to parent
  folder, otherwise delete a character backward"
    (interactive "p")
    (if minibuffer-completing-file-name
        ;; Borrowed from https://github.com/raxod502/selectrum/issues/498#issuecomment-803283608
        (if (string-match-p "/." (minibuffer-contents))
            (zap-up-to-char (- arg) ?/)
          (delete-minibuffer-contents))
        (delete-backward-char arg)))
                 ;; Enable vertico
              (use-package vertico
                :bind (:map minibuffer-local-map
                            ("<backspace>" . dw/minibuffer-backward-kill))
            :custom
            ;; (vertico-scroll-margin 0) ;; Different scroll margin
            ;; (vertico-count 20) ;; Show more candidates
            ;; (vertico-resize t) ;; Grow and shrink the Vertico minibuffer
            ;; (vertico-cycle t) ;; Enable cycling for `vertico-next/previous'
            (keymap-set vertico-map "?" #'minibuffer-completion-help)
            (keymap-set vertico-map "M-TAB" #'minibuffer-complete)

            :init
            (vertico-mode))

          ;; Persist history over Emacs restarts. Vertico sorts by history position.
          (use-package savehist
            :init
            (savehist-mode))

          ;; A few more useful configurations...
          (use-package emacs
            :custom
            ;; Support opening new minibuffers from inside existing minibuffers.
            (enable-recursive-minibuffers t)
            ;; Hide commands in M-x which do not work in the current mode.  Vertico
            ;; commands are hidden in normal buffers. This setting is useful beyond
            ;; Vertico.
            (read-extended-command-predicate #'command-completion-default-include-p)
            :init
            ;; Add prompt indicator to `completing-read-multiple'.
            ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
            (defun crm-indicator (args)
              (cons (format "[CRM%s] %s"
                            (replace-regexp-in-string
                             "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                             crm-separator)
                            (car args))
                    (cdr args)))
            (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

            ;; Do not allow the cursor in the minibuffer prompt
            (setq minibuffer-prompt-properties
                  '(read-only t cursor-intangible t face minibuffer-prompt))
            (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode))

          (use-package orderless
          :custom
          ;; Configure a custom style dispatcher (see the Consult wiki)
          ;; (orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch))
          ;; (orderless-component-separator #'orderless-escapable-split-on-space)
          (completion-styles '(orderless basic))
          (completion-category-defaults nil)
          (completion-category-overrides '((file (styles partial-completion)))))

          (setq completion-styles '(basic substring partial-completion flex))
          (setq read-file-name-completion-ignore-case t
              read-buffer-completion-ignore-case t
              completion-ignore-case t)
          (setq completion-in-region-function
              (lambda (&rest args)
                (apply (if vertico-mode
                           #'consult-completion-in-region)
                       args)))

          (use-package vertico-directory
          :after vertico
          :ensure nil
          ;; More convenient directory navigation commands
          :bind (:map vertico-map
                      ("RET" . vertico-directory-enter)
                      ("DEL" . vertico-directory-delete-char)
                      ("M-DEL" . vertico-directory-delete-word))
          ;; Tidy shadowed file names
          :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

          (vertico-multiform-mode)

        ;; Configure the display per command.
        ;; Use a buffer with indices for imenu
        ;; and a flat (Ido-like) menu for M-x.
        (setq vertico-multiform-commands
              '((consult-imenu buffer indexed)
                (execute-extended-command unobtrusive)))

        ;; Configure the display per completion category.
        ;; Use the grid display for files and a buffer
        ;; for the consult-grep commands.
        (setq vertico-multiform-categories
              '((file grid)
                (consult-grep buffer)))

        (setq vertico-multiform-commands
            `((consult-outline buffer ,(lambda (_) (text-scale-set -1)))))

        ;; Change the default sorting function.
      ;; See `vertico-sort-function' and `vertico-sort-override-function'.
      (setq vertico-multiform-commands
            '((describe-symbol (vertico-sort-function . vertico-sort-alpha))))

      (setq vertico-multiform-categories
            '((symbol (vertico-sort-function . vertico-sort-alpha))
              (file (vertico-sort-function . sort-directories-first))))

      ;; Sort directories before files
      (defun sort-directories-first (files)
        (setq files (vertico-sort-history-length-alpha files))
        (nconc (seq-filter (lambda (x) (string-suffix-p "/" x)) files)
               (seq-remove (lambda (x) (string-suffix-p "/" x)) files)))

      ;; Configure the buffer display and the buffer display action
    (setq vertico-multiform-categories
          '((consult-grep
             buffer
             (vertico-buffer-display-action . (display-buffer-same-window)))))

    ;; Disable preview for consult-grep commands

    (setq vertico-multiform-categories
        '((buffer flat (vertico-cycle . t))))

#+end_src

