public/config.html


<div id="outline-container-org82cb5bd" class="outline-2">
<h2 id="org82cb5bd">vertico</h2>
<div class="outline-text-2" id="text-org82cb5bd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">dw/minibuffer-backward-kill</span> (arg)
  <span style="font-style: italic;">"When minibuffer is completing a file name delete up to parent</span>
<span style="font-style: italic;">folder, otherwise delete a character backward"</span>
  (<span style="font-weight: bold;">interactive</span> <span style="font-style: italic;">"p"</span>)
  (<span style="font-weight: bold;">if</span> minibuffer-completing-file-name
      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Borrowed from https://github.com/raxod502/selectrum/issues/498#issuecomment-803283608</span>
      (<span style="font-weight: bold;">if</span> (string-match-p <span style="font-style: italic;">"/."</span> (minibuffer-contents))
          (zap-up-to-char (- arg) ?/)
        (delete-minibuffer-contents))
      (delete-backward-char arg)))
               <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable vertico</span>
            (<span style="font-weight: bold;">use-package</span> vertico
              <span style="font-weight: bold;">:bind</span> (<span style="font-weight: bold;">:map</span> minibuffer-local-map
                          (<span style="font-style: italic;">"&lt;backspace&gt;"</span> . dw/minibuffer-backward-kill))
          <span style="font-weight: bold;">:custom</span>
          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(vertico-scroll-margin 0) ;; Different scroll margin</span>
          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(vertico-count 20) ;; Show more candidates</span>
          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(vertico-resize t) ;; Grow and shrink the Vertico minibuffer</span>
          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(vertico-cycle t) ;; Enable cycling for `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">vertico-next/previous</span><span style="font-weight: bold; font-style: italic;">'</span>
          (keymap-set vertico-map <span style="font-style: italic;">"?"</span> #'minibuffer-completion-help)
          (keymap-set vertico-map <span style="font-style: italic;">"M-TAB"</span> #'minibuffer-complete)

          <span style="font-weight: bold;">:init</span>
          (vertico-mode))

        <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Persist history over Emacs restarts. Vertico sorts by history position.</span>
        (<span style="font-weight: bold;">use-package</span> savehist
          <span style="font-weight: bold;">:init</span>
          (savehist-mode))

        <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">A few more useful configurations...</span>
        (<span style="font-weight: bold;">use-package</span> emacs
          <span style="font-weight: bold;">:custom</span>
          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Support opening new minibuffers from inside existing minibuffers.</span>
          (enable-recursive-minibuffers t)
          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Hide commands in M-x which do not work in the current mode.  Vertico</span>
          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">commands are hidden in normal buffers. This setting is useful beyond</span>
          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Vertico.</span>
          (read-extended-command-predicate #'command-completion-default-include-p)
          <span style="font-weight: bold;">:init</span>
          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add prompt indicator to `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">completing-read-multiple</span><span style="font-weight: bold; font-style: italic;">'.</span>
          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">We display [CRM&lt;separator&gt;], e.g., [CRM,] if the separator is a comma.</span>
          (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">crm-indicator</span> (args)
            (cons (format <span style="font-style: italic;">"[CRM%s] %s"</span>
                          (replace-regexp-in-string
                           <span style="font-style: italic;">"\\`\\[</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">.*?</span><span style="font-style: italic;">]\\*</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">\\[</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">.*?</span><span style="font-style: italic;">]\\*\\'"</span> <span style="font-style: italic;">""</span>
                           crm-separator)
                          (car args))
                  (cdr args)))
          (advice-add #'completing-read-multiple <span style="font-weight: bold;">:filter-args</span> #'crm-indicator)

          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Do not allow the cursor in the minibuffer prompt</span>
          (<span style="font-weight: bold;">setq</span> minibuffer-prompt-properties
                '(read-only t cursor-intangible t face minibuffer-prompt))
          (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode))

        (<span style="font-weight: bold;">use-package</span> orderless
        <span style="font-weight: bold;">:custom</span>
        <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Configure a custom style dispatcher (see the Consult wiki)</span>
        <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch))</span>
        <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(orderless-component-separator #'orderless-escapable-split-on-space)</span>
        (completion-styles '(orderless basic))
        (completion-category-defaults nil)
        (completion-category-overrides '((file (styles partial-completion)))))

        (<span style="font-weight: bold;">setq</span> completion-styles '(basic substring partial-completion flex))
        (<span style="font-weight: bold;">setq</span> read-file-name-completion-ignore-case t
            read-buffer-completion-ignore-case t
            completion-ignore-case t)
        (<span style="font-weight: bold;">setq</span> completion-in-region-function
            (<span style="font-weight: bold;">lambda</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;rest</span> args)
              (apply (<span style="font-weight: bold;">if</span> vertico-mode
                         #'consult-completion-in-region)
                     args)))

        (<span style="font-weight: bold;">use-package</span> vertico-directory
        <span style="font-weight: bold;">:after</span> vertico
        <span style="font-weight: bold;">:ensure</span> nil
        <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">More convenient directory navigation commands</span>
        <span style="font-weight: bold;">:bind</span> (<span style="font-weight: bold;">:map</span> vertico-map
                    (<span style="font-style: italic;">"RET"</span> . vertico-directory-enter)
                    (<span style="font-style: italic;">"DEL"</span> . vertico-directory-delete-char)
                    (<span style="font-style: italic;">"M-DEL"</span> . vertico-directory-delete-word))
        <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Tidy shadowed file names</span>
        <span style="font-weight: bold;">:hook</span> (rfn-eshadow-update-overlay . vertico-directory-tidy))

        (vertico-multiform-mode)

      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Configure the display per command.</span>
      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use a buffer with indices for imenu</span>
      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">and a flat (Ido-like) menu for M-x.</span>
      (<span style="font-weight: bold;">setq</span> vertico-multiform-commands
            '((consult-imenu buffer indexed)
              (execute-extended-command unobtrusive)))

      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Configure the display per completion category.</span>
      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use the grid display for files and a buffer</span>
      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">for the consult-grep commands.</span>
      (<span style="font-weight: bold;">setq</span> vertico-multiform-categories
            '((file grid)
              (consult-grep buffer)))

      (<span style="font-weight: bold;">setq</span> vertico-multiform-commands
          `((consult-outline buffer ,(<span style="font-weight: bold;">lambda</span> (_) (text-scale-set -1)))))

      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Change the default sorting function.</span>
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">See `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">vertico-sort-function</span><span style="font-weight: bold; font-style: italic;">' and `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">vertico-sort-override-function</span><span style="font-weight: bold; font-style: italic;">'.</span>
    (<span style="font-weight: bold;">setq</span> vertico-multiform-commands
          '((describe-symbol (vertico-sort-function . vertico-sort-alpha))))

    (<span style="font-weight: bold;">setq</span> vertico-multiform-categories
          '((symbol (vertico-sort-function . vertico-sort-alpha))
            (file (vertico-sort-function . sort-directories-first))))

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Sort directories before files</span>
    (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">sort-directories-first</span> (files)
      (<span style="font-weight: bold;">setq</span> files (vertico-sort-history-length-alpha files))
      (nconc (seq-filter (<span style="font-weight: bold;">lambda</span> (x) (string-suffix-p <span style="font-style: italic;">"/"</span> x)) files)
             (seq-remove (<span style="font-weight: bold;">lambda</span> (x) (string-suffix-p <span style="font-style: italic;">"/"</span> x)) files)))

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Configure the buffer display and the buffer display action</span>
  (<span style="font-weight: bold;">setq</span> vertico-multiform-categories
        '((consult-grep
           buffer
           (vertico-buffer-display-action . (display-buffer-same-window)))))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Disable preview for consult-grep commands</span>

  (<span style="font-weight: bold;">setq</span> vertico-multiform-categories
      '((buffer flat (vertico-cycle . t))))

</pre>
</div>
</div>
</div>
