public/config.html

<div id="outline-container-org4385ffb" class="outline-2">
<h2 id="org4385ffb">consult</h2>
<div class="outline-text-2" id="text-org4385ffb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="font-weight: bold;">use-package</span> consult
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Replace bindings. Lazily loaded by `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">use-package</span><span style="font-weight: bold; font-style: italic;">'.</span>
  <span style="font-weight: bold;">:bind</span> (<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">C-c bindings in `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">mode-specific-map</span><span style="font-weight: bold; font-style: italic;">'</span>
         (<span style="font-style: italic;">"C-c M-x"</span> . consult-mode-command)
         (<span style="font-style: italic;">"C-c h"</span> . consult-history)
         (<span style="font-style: italic;">"C-c k"</span> . consult-kmacro)
         (<span style="font-style: italic;">"C-c m"</span> . consult-man)
         (<span style="font-style: italic;">"C-c i"</span> . consult-info)
         ([remap Info-search] . consult-info)
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">C-x bindings in `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">ctl-x-map</span><span style="font-weight: bold; font-style: italic;">'</span>
         (<span style="font-style: italic;">"C-x M-:"</span> . consult-complex-command)     <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. repeat-complex-command</span>
         (<span style="font-style: italic;">"C-x b"</span> . consult-buffer)                <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. switch-to-buffer</span>
         (<span style="font-style: italic;">"C-x 4 b"</span> . consult-buffer-other-window) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. switch-to-buffer-other-window</span>
         (<span style="font-style: italic;">"C-x 5 b"</span> . consult-buffer-other-frame)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. switch-to-buffer-other-frame</span>
         (<span style="font-style: italic;">"C-x t b"</span> . consult-buffer-other-tab)    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. switch-to-buffer-other-tab</span>
         (<span style="font-style: italic;">"C-x r b"</span> . consult-bookmark)            <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. bookmark-jump</span>
         (<span style="font-style: italic;">"C-x p b"</span> . consult-project-buffer)      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. project-switch-to-buffer</span>
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Custom M-# bindings for fast register access</span>
         (<span style="font-style: italic;">"M-#"</span> . consult-register-load)
         (<span style="font-style: italic;">"M-'"</span> . consult-register-store)          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. abbrev-prefix-mark (unrelated)</span>
         (<span style="font-style: italic;">"C-M-#"</span> . consult-register)
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Other custom bindings</span>
         (<span style="font-style: italic;">"M-y"</span> . consult-yank-pop)                <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. yank-pop</span>
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">M-g bindings in `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">goto-map</span><span style="font-weight: bold; font-style: italic;">'</span>
         (<span style="font-style: italic;">"M-g e"</span> . consult-compile-error)
         (<span style="font-style: italic;">"M-g f"</span> . consult-flymake)               <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Alternative: consult-flycheck</span>
         (<span style="font-style: italic;">"M-g g"</span> . consult-goto-line)             <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. goto-line</span>
         (<span style="font-style: italic;">"M-g M-g"</span> . consult-goto-line)           <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. goto-line</span>
         (<span style="font-style: italic;">"M-g o"</span> . consult-outline)               <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Alternative: consult-org-heading</span>
         (<span style="font-style: italic;">"M-g m"</span> . consult-mark)
         (<span style="font-style: italic;">"M-g k"</span> . consult-global-mark)
         (<span style="font-style: italic;">"M-g i"</span> . consult-imenu)
         (<span style="font-style: italic;">"M-g I"</span> . consult-imenu-multi)
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">M-s bindings in `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">search-map</span><span style="font-weight: bold; font-style: italic;">'</span>
         (<span style="font-style: italic;">"M-s d"</span> . consult-find)                  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Alternative: consult-fd</span>
         (<span style="font-style: italic;">"M-s c"</span> . consult-locate)
         (<span style="font-style: italic;">"M-s g"</span> . consult-grep)
         (<span style="font-style: italic;">"M-s G"</span> . consult-git-grep)
         (<span style="font-style: italic;">"M-s r"</span> . consult-ripgrep)
         (<span style="font-style: italic;">"C-s"</span> . consult-line)
         (<span style="font-style: italic;">"M-s L"</span> . consult-line-multi)
         (<span style="font-style: italic;">"M-s k"</span> . consult-keep-lines)
         (<span style="font-style: italic;">"M-s u"</span> . consult-focus-lines)
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Isearch integration</span>
         (<span style="font-style: italic;">"M-s e"</span> . consult-isearch-history)
         <span style="font-weight: bold;">:map</span> isearch-mode-map
         (<span style="font-style: italic;">"M-e"</span> . consult-isearch-history)         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. isearch-edit-string</span>
         (<span style="font-style: italic;">"M-s e"</span> . consult-isearch-history)       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. isearch-edit-string</span>
         (<span style="font-style: italic;">"M-s l"</span> . consult-line)                  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">needed by consult-line to detect isearch</span>
         (<span style="font-style: italic;">"M-s L"</span> . consult-line-multi)            <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">needed by consult-line to detect isearch</span>
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Minibuffer history</span>
         <span style="font-weight: bold;">:map</span> minibuffer-local-map
         (<span style="font-style: italic;">"M-s"</span> . consult-history)                 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. next-matching-history-element</span>
         (<span style="font-style: italic;">"M-r"</span> . consult-history))                <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">orig. previous-matching-history-element</span>

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable automatic preview at point in the *Completions* buffer. This is</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">relevant when you use the default completion UI.</span>
  <span style="font-weight: bold;">:hook</span> (completion-list-mode . consult-preview-at-point-mode)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">The :init configuration is always executed (Not lazy)</span>
  <span style="font-weight: bold;">:init</span>

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Optionally configure the register formatting. This improves the register</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">preview for `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">consult-register</span><span style="font-weight: bold; font-style: italic;">', `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">consult-register-load</span><span style="font-weight: bold; font-style: italic;">',</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">`</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">consult-register-store</span><span style="font-weight: bold; font-style: italic;">' and the Emacs built-ins.</span>
  (<span style="font-weight: bold;">setq</span> register-preview-delay 0.5
        register-preview-function #'consult-register-format)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Optionally tweak the register preview window.</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This adds thin lines, sorting and hides the mode line of the window.</span>
  (advice-add #'register-preview <span style="font-weight: bold;">:override</span> #'consult-register-window)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use Consult to select xref locations with preview</span>
  (<span style="font-weight: bold;">setq</span> xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Configure other variables and modes in the :config section,</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">after lazily loading the package.</span>
  <span style="font-weight: bold;">:config</span>

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Optionally configure preview. The default value</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">is 'any, such that any key triggers the preview.</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(setq consult-preview-key 'any)</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(setq consult-preview-key "M-.")</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(setq consult-preview-key '("S-&lt;down&gt;" "S-&lt;up&gt;"))</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">For some commands and buffer sources it is useful to configure the</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">:preview-key on a per-command basis using the `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">consult-customize</span><span style="font-weight: bold; font-style: italic;">' macro.</span>
  (consult-customize
   consult-theme <span style="font-weight: bold;">:preview-key</span> '(<span style="font-weight: bold;">:debounce</span> 0.2 any)
   consult-ripgrep consult-git-grep consult-grep consult-buffer
   consult-bookmark consult-recent-file consult-xref
   consult--source-bookmark consult--source-file-register
   consult--source-recent-file consult--source-project-recent-file <span style="font-weight: bold;">:preview-key</span> 'any)
   <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">:preview-key "M-.":preview-key 'any)</span>


  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Optionally configure the narrowing key.</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Both &lt; and C-+ work reasonably well.</span>
  (<span style="font-weight: bold;">setq</span> consult-narrow-key <span style="font-style: italic;">"&lt;"</span>) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">"C-+"</span>

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Optionally make narrowing help available in the minibuffer.</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">You may want to use `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">embark-prefix-help-command</span><span style="font-weight: bold; font-style: italic;">' or which-key instead.</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(keymap-set consult-narrow-map (concat consult-narrow-key " ?") #'consult-narrow-help)</span>
)
</pre>
</div>
</div>
</div>
