content/config.org
* nix mode

#+begin_src emacs-lisp
  (use-package nix-mode
    :mode "\\.nix\\'")

  #+end_src

* dashboard

[[https:github.com/emacs-dashboard/emacs-dashboard][emacs dashboard
]]
#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (setq initial-buffer-choice (lambda () (get-buffer-create dashboard-buffer-name)))
    (dashboard-setup-startup-hook)
    (setq dashboard-items '((recents . 3)
                            (bookmarks . 5)
                            (agenda . 5)))
    (setq dashboard-agenda-sort-strategy '(time-up habit-down priority-down category-keep))
    (setq dashboard-agenda-time-string-format "%m-%d %a"))

  (custom-set-faces
   '(dashboard-item-title-face
     ((t (:height 1.9))))
   '(dashboard-agenda-item-face
     ((t (:height 1.9)))))
#+end_src

