public/config.html





<div id="outline-container-orgda046ac" class="outline-2">
<h2 id="orgda046ac">nix mode</h2>
<div class="outline-text-2" id="text-orgda046ac">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> nix-mode
  <span style="font-weight: bold;">:mode</span> <span style="font-style: italic;">"\\.nix\\'"</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-org0b90708" class="outline-2">
<h2 id="org0b90708">dashboard</h2>
<div class="outline-text-2" id="text-org0b90708">
<p>
<a href="https:github.com/emacs-dashboard/emacs-dashboard">emacs dashboard
</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> dashboard
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> initial-buffer-choice (<span style="font-weight: bold;">lambda</span> () (get-buffer-create dashboard-buffer-name)))
  (dashboard-setup-startup-hook)
  (<span style="font-weight: bold;">setq</span> dashboard-items '((recents . 3)
                          (bookmarks . 5)
                          (agenda . 5)))
  (<span style="font-weight: bold;">setq</span> dashboard-agenda-sort-strategy '(time-up habit-down priority-down category-keep))
  (<span style="font-weight: bold;">setq</span> dashboard-agenda-time-string-format <span style="font-style: italic;">"%m-%d %a"</span>))

(custom-set-faces
 '(dashboard-item-title-face
   ((t (<span style="font-weight: bold;">:height</span> 1.9))))
 '(dashboard-agenda-item-face
   ((t (<span style="font-weight: bold;">:height</span> 1.9)))))
</pre>
</div>
</div>
</div>
