public/config.html

<div id="outline-container-orgcf0b251" class="outline-2">
<h2 id="orgcf0b251">treemacs</h2>
<div class="outline-text-2" id="text-orgcf0b251">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
 (<span style="font-weight: bold;">use-package</span> treemacs
   <span style="font-weight: bold;">:ensure</span> t
   <span style="font-weight: bold;">:defer</span> t
<span style="font-weight: bold; font-style: italic;">;   </span><span style="font-weight: bold; font-style: italic;">:init</span>
<span style="font-weight: bold; font-style: italic;">;   </span><span style="font-weight: bold; font-style: italic;">(with-eval-after-load 'winum</span>
<span style="font-weight: bold; font-style: italic;">;     </span><span style="font-weight: bold; font-style: italic;">(define-key winum-keymap (kbd "M-0") #'treemacs-select-window))</span>
   <span style="font-weight: bold;">:config</span>
   (<span style="font-weight: bold;">progn</span>
     (<span style="font-weight: bold;">setq</span> treemacs-collapse-dirs (<span style="font-weight: bold;">if</span> treemacs-python-executable 3 0)
           treemacs-deferred-git-apply-delay 0.5
           treemacs-directory-name-transformer      #'identity
           treemacs-display-in-side-window          t
           treemacs-eldoc-display                   'simple
           treemacs-file-event-delay                2000
           treemacs-file-extension-regex            treemacs-last-period-regex-value
           treemacs-file-follow-delay               0.2
           treemacs-file-name-transformer           #'identity
           treemacs-follow-after-init               t
           treemacs-expand-after-init               t
           treemacs-find-workspace-method           'find-for-file-or-pick-first
           treemacs-git-command-pipe                <span style="font-style: italic;">""</span>
           treemacs-goto-tag-strategy               'refetch-index
           treemacs-header-scroll-indicators        '(nil . <span style="font-style: italic;">"^^^^^^"</span>)
           treemacs-hide-dot-git-directory          t
           treemacs-indentation                     2
           treemacs-indentation-string              <span style="font-style: italic;">" "</span>
           treemacs-is-never-other-window           nil
           treemacs-max-git-entries                 5000
           treemacs-missing-project-action          'ask
           treemacs-move-files-by-mouse-dragging    t
           treemacs-move-forward-on-expand          nil
           treemacs-no-png-images                   nil
           treemacs-no-delete-other-windows         t
           treemacs-project-follow-cleanup          nil
           treemacs-persist-file                    (expand-file-name <span style="font-style: italic;">".cache/treemacs-persist"</span> user-emacs-directory)
           treemacs-position                        'left
           treemacs-read-string-input               'from-child-frame
           treemacs-recenter-distance               0.1
           treemacs-recenter-after-file-follow      nil
           treemacs-recenter-after-tag-follow       nil
           treemacs-recenter-after-project-jump     'always
           treemacs-recenter-after-project-expand   'on-distance
           treemacs-litter-directories              '(<span style="font-style: italic;">"/node_modules"</span> <span style="font-style: italic;">"/.venv"</span> <span style="font-style: italic;">"/.cask"</span>)
           treemacs-project-follow-into-home        nil
           treemacs-show-cursor                     nil
           treemacs-show-hidden-files               t
           treemacs-silent-filewatch                nil
           treemacs-silent-refresh                  nil
           treemacs-sorting                         'alphabetic-asc
           treemacs-select-when-already-in-treemacs 'move-back
           treemacs-space-between-root-nodes        t
           treemacs-tag-follow-cleanup              t
           treemacs-tag-follow-delay                1.5
           treemacs-text-scale                      nil
           treemacs-user-mode-line-format           nil
           treemacs-user-header-line-format         nil
           treemacs-wide-toggle-width               70
           treemacs-width                           35
           treemacs-width-increment                 1
           treemacs-width-is-initially-locked       t
           treemacs-workspace-switch-cleanup        nil)

     <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">The default width and height of the icons is 22 pixels. If you are</span>
     <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">using a Hi-DPI display, uncomment this to double the icon size.</span>
     <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(treemacs-resize-icons 44)</span>

     (treemacs-follow-mode t)
     (treemacs-filewatch-mode t)
     (treemacs-fringe-indicator-mode 'always)
     (<span style="font-weight: bold;">when</span> treemacs-python-executable
       (treemacs-git-commit-diff-mode t))

     (<span style="font-weight: bold;">pcase</span> (cons (not (null (executable-find <span style="font-style: italic;">"git"</span>)))
                  (not (null treemacs-python-executable)))
       (`(t . t)
        (treemacs-git-mode 'deferred))
       (`(t . _)
        (treemacs-git-mode 'simple)))

     (treemacs-hide-gitignored-files-mode nil))
   <span style="font-weight: bold;">:bind</span>
   (<span style="font-weight: bold;">:map</span> global-map
         (<span style="font-style: italic;">"M-0"</span>       . treemacs-select-window)
         (<span style="font-style: italic;">"C-x t 1"</span>   . treemacs-delete-other-windows)
         (<span style="font-style: italic;">"C-x t t"</span>   . treemacs)
         (<span style="font-style: italic;">"C-x t d"</span>   . treemacs-select-directory)
         (<span style="font-style: italic;">"C-x t B"</span>   . treemacs-bookmark)
         (<span style="font-style: italic;">"C-x t C-t"</span> . treemacs-find-file)
         (<span style="font-style: italic;">"C-x t M-t"</span> . treemacs-find-tag)))

 (<span style="font-weight: bold;">use-package</span> treemacs-evil
   <span style="font-weight: bold;">:after</span> (treemacs evil)
   <span style="font-weight: bold;">:ensure</span> t)

 (<span style="font-weight: bold;">use-package</span> treemacs-projectile
   <span style="font-weight: bold;">:after</span> (treemacs projectile)
   <span style="font-weight: bold;">:ensure</span> t)

 (<span style="font-weight: bold;">use-package</span> treemacs-icons-dired
   <span style="font-weight: bold;">:hook</span> (dired-mode . treemacs-icons-dired-enable-once)
   <span style="font-weight: bold;">:ensure</span> t)

 (<span style="font-weight: bold;">use-package</span> treemacs-magit
   <span style="font-weight: bold;">:after</span> (treemacs magit)
   <span style="font-weight: bold;">:ensure</span> t)

 (<span style="font-weight: bold;">use-package</span> treemacs-persp <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">treemacs-perspective if you use perspective.el vs. persp-mode</span>
   <span style="font-weight: bold;">:after</span> (treemacs persp-mode) <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">or perspective vs. persp-mode</span>
   <span style="font-weight: bold;">:ensure</span> t
   <span style="font-weight: bold;">:config</span> (treemacs-set-scope-type 'Perspectives))

 (<span style="font-weight: bold;">use-package</span> treemacs-tab-bar <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">treemacs-tab-bar if you use tab-bar-mode</span>
   <span style="font-weight: bold;">:after</span> (treemacs)
   <span style="font-weight: bold;">:ensure</span> t
   <span style="font-weight: bold;">:config</span> (treemacs-set-scope-type 'Tabs))

 (treemacs-start-on-boot)
</pre>
</div>
</div>
</div>


<div id="outline-container-org501e279" class="outline-2">
<h2 id="org501e279">javascript stuff</h2>
<div class="outline-text-2" id="text-org501e279">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">setq</span> js-indent-level 2)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd781bba" class="outline-2">
<h2 id="orgd781bba">miscellaneous settings</h2>
<div class="outline-text-2" id="text-orgd781bba">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-display-line-numbers-mode)
(<span style="font-weight: bold;">setq</span> ring-bell-function 'ignore)
(add-to-list 'safe-local-variable-values '(org-roam-directory . <span style="font-style: italic;">"~/Documents/wizr/meetingnotes"</span>))
(add-to-list 'safe-local-variable-values '(org-roam-db-location . <span style="font-style: italic;">"~/Documents/wizr/meetingnotes/org-roam.db"</span>))

(<span style="font-weight: bold;">use-package</span> simple-httpd
  <span style="font-weight: bold;">:ensure</span> t)


</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
